{
    "ee": {
        "organization": "ee",
        "mediaUrl": "/img/icon-ee.png",
        "text": {
            "title": "Software Engineer (May 22 - March 25)",
            "subtitle": "Exponential Entertainment Inc.",
            "description": [
                "Collaborated cross-functionally in an AGILE environment to deliver promotional games for MAX, Paramount, FOX, and other top media studios, boosting brand revenue and engagement in 40+ contracts",
                "Responsible for monthly updates to Game Rooms deployed on national cable platforms through Comcast, Contour, and Verizon - including design implementation, app configurations, custom feature integrations, build deployments, and end-to-end testing",
                "Refactored client/server side codebases (JS, Node.js, Serverless) to enhance maintainability, reduce complexity and duplication, and optimize performance - cutting build/runtime load times and operational costs.",
                "Built 15 custom game engines for the HollywoodPlayer domain - including Scene Streak (Simon Says-style game using media stills) and Tile Swap (a timed challenge to unscramble TV/movie scenes), resulting in millions of playthroughs and increased user retention.",
                "Designed and developed an internal admin search tool leveraging image recognition to store, categorize, and retrieve assets by keyword, face, object, or visual similarity using AWS - streamlining content discovery and management.",
                "Maintained and extended scalable backend systems using AWS, ensuring seamless compatibility across browsers, mobile devices, and custom hardware.",
                "Engineered reusable Vue components for the Clipology online/board game, supporting its growth to 180,000+ player accounts and widespread party gameplay while maintaining a 4.5 star Amazon rating."
            ]
        }
    },
    "caaml": {
        "organization": "wwu",
        "mediaUrl": "/img/icon-wwu.png",
        "text": {
            "title": "Frontend Engineer (Jan 21 - Dec 21)",
            "subtitle": "Instructor Efficiency Tool (CAAML Web Tool) - Western Washington University",
            "description": [
                "Developed an interactive web tool using JavaScript, Node, and Express to visualize machine learning algorithm outputs, significantly enhancing instructor efficiency in class scheduling. As the lead on front-end development, I routed and styled all web pages using HTML, CSS, and JavaScript and designed dynamic D3 visualizations to improve usability and overall user experience. In addition, I simplified project workflows using Trello boards and Agile Scrum practices, ensuring consistent progress and alignment with client goals."
            ]
        }
    },
    "puf": {
        "organization": "wwu",
        "mediaUrl": "/img/icon-wwu.png",
        "text": {
            "title": "Research Assistant (Oct 20 - Dec 21)",
            "subtitle": "Research Assistant under Professor Tarek Idriss - Western Washington University",
            "description": [
                "Developed and tested multiple Python-based software models to simulate novel hardware security concepts. Designed and executed benchmarking scripts using machine learning techniques to evaluate performance on generated data. Utilized Weights & Biases (wandb) to record, visualize, and analyze results, comparing the effectiveness of implemented security measures against other types of Physical Unclonable Functions (PUFs)."
            ]
        }
    },
    "centurylink": {
        "organization": "centurylink",
        "mediaUrl": "/img/icon-centurylink.png",
        "text": {
            "title": "Office Associate (Sep 16 - Sep 20)",
            "subtitle": "Centurylink",
            "description": [
                "Supported company-wide data consolidation efforts during a multi-company merger by creating and importing digital files into internal databases using proprietary software. Managed the organization and preparation of employee and customer documents for secure archival shipment."
            ]
        }
    }
}
