{
    "ee": {
        "organization": "ee",
        "mediaUrl": "/img/icon-ee.png",
        "text": {
            "title": "Software Engineer (May 22 - Mar 25)",
            "subtitle": "Exponential Entertainment Inc.",
            "description": [
                "Collaborated cross-functionally in an AGILE environment to deliver promotional games for MAX, Paramount, FOX, and other top media studios, boosting brand revenue and engagement in 40+ contracts",
                "Responsible for monthly updates to Game Rooms deployed on national cable platforms through Comcast, Contour, and Verizon - including design implementation, app configurations, custom feature integrations, build deployments, and end-to-end testing",
                "Refactored client/server side codebases (JS, Node.js, Serverless) to enhance maintainability, reduce complexity and duplication, and optimize performance - cutting build/runtime load times and operational costs.",
                "Built 15 custom game engines for the HollywoodPlayer domain - including Scene Streak (Simon Says-style game using media stills) and Tile Swap (a timed challenge to unscramble TV/movie scenes), resulting in millions of playthroughs and increased user retention.",
                "Designed and developed an internal admin search tool leveraging image recognition to store, categorize, and retrieve assets by keyword, face, object, or visual similarity using AWS - streamlining content discovery and management.",
                "Maintained and extended scalable backend systems using AWS, ensuring seamless compatibility across browsers, mobile devices, and custom hardware.",
                "Engineered reusable Vue components for the Clipology online/board game, supporting its growth to 180,000+ player accounts and widespread party gameplay while maintaining a 4.5 star Amazon rating.",
                "(Waiting for screenshots...)"
            ]
        }
    },
    "caaml": {
        "organization": "wwu",
        "mediaUrl": "/img/icon-wwu.png",
        "text": {
            "title": "Frontend Engineer (Jan 21 - Dec 21)",
            "subtitle": "Department of Computer Science at Western Washington University",
            "description": [
                "Developed an interactive web tool using JavaScript, Node, and Express to visualize machine learning algorithm outputs, significantly enhancing instructor efficiency in class scheduling. As the lead on front-end development, I routed and styled all web pages using HTML, CSS, and JavaScript and designed dynamic D3 visualizations to improve usability and overall user experience. In addition, I simplified project workflows using Trello boards and Agile Scrum practices, ensuring consistent progress and alignment with client goals."
            ]
        },
        "carousel": {
            "expandText": "Screenshots",
            "collapseText": "Hide",
            "carouselItems": [
                {
                    "mediaUrl": "/img/caaml/caaml1.png",
                    "text": [
                        "[Landing]",
                        "Describes use cases of our product, tutorials, and explanations of the various graphs included.",
                        "Login is connected to WWU's CAS Login System."
                    ]
                },
                {
                    "mediaUrl": "/img/caaml/caaml3.png",
                    "text": [
                        "[Courses]: New Term",
                        "Once logged in, you can go to your user associated the 'my courses' page where you can create terms.",
                        "This of course tied into the backend to verify term data."
                    ]
                },
                {
                    "mediaUrl": "/img/caaml/caaml4.png",
                    "text": [
                        "[Courses]: Add",
                        "This modal handles the sub folder that holds actual classroom lectures. This course is then added to whichever term is selected from the drop down you see right above."
                    ]
                },
                {
                    "mediaUrl": "/img/caaml/caaml5.png",
                    "text": [
                        "[Courses]: Term Selector & Course Cards",
                        "This image is demonstrating how the dropdown works and what the course cards look like. You can click \"Go\" on any of these cards to view that courses' lectures."
                    ]
                },
                {
                    "mediaUrl": "/img/caaml/caaml6.png",
                    "text": ["[Courses]: Remove"]
                },
                {
                    "mediaUrl": "/img/caaml/caaml8.png",
                    "text": [
                        "[Record]",
                        "Professors get to this page before each class session and setup their mic and/or camera.",
                        "Since we didn't have a classroom, we could not showcase the real time data translation in the preview."
                    ]
                },
                {
                    "mediaUrl": "/img/caaml/caaml10.png",
                    "text": [
                        "[Chart]: Heat Map",
                        "Shows the average of all activities selected on the left hand side.",
                        "User is able to select and deselect activities to compare specific data."
                    ]
                },
                {
                    "mediaUrl": "/img/caaml/caaml11.png",
                    "text": [
                        "[Chart]: Activity Trace",
                        "This is showing all classroom sessions for a course, comparing general instructor activity vs. Student Question/Answer activies."
                    ]
                },
                {
                    "mediaUrl": "/img/caaml/caaml12.png",
                    "text": [
                        "[Chart]: Activity Trace",
                        "This is total lecture time throughout the course."
                    ]
                },
                {
                    "mediaUrl": "/img/caaml/caaml13.png",
                    "text": [
                        "[Chart]: Activity Trace",
                        "Above is meant to show the ability to filter by day.",
                        "User is able to select N number of days they want to compare."
                    ]
                },
                {
                    "mediaUrl": "/img/caaml/caaml14.png",
                    "text": [
                        "[Chart]: Pie Chart & Line Graph",
                        "Two of the simpler graphs to show overall time spent on selected activities, and when the spikes in those activities took place."
                    ]
                }
            ]
        }
    },
    "puf": {
        "organization": "wwu",
        "mediaUrl": "/img/icon-wwu.png",
        "text": {
            "title": "Research Assistant (Oct 20 - Dec 21)",
            "subtitle": "Department of Computer Science at Western Washington University",
            "description": [
                "Developed and tested multiple Python-based software models to simulate novel hardware security concepts. Designed and executed benchmarking scripts using machine learning techniques to evaluate performance on generated data. Utilized Weights & Biases (wandb) to record, visualize, and analyze results, comparing the effectiveness of implemented security measures against other types of Physical Unclonable Functions (PUFs)."
            ]
        },
        "carousel": {
            "expandText": "PUF Documents",
            "collapseText": "Hide",
            "carouselItems": [
                {
                    "mediaUrl": "/img/puf/mempuf.pdf",
                    "text": [
                        "",
                        "Cumulative paper written by me to document and pass down knowledge of the PUFs and CLI testing options I created"
                    ]
                },
                {
                    "mediaUrl": "/img/puf/cluster_jobs.pdf",
                    "text": [
                        "",
                        "Concise rundown of how to run jobs on the cluster against PUFs for incoming researchers."
                    ]
                }
            ]
        }
    },
    "centurylink": {
        "organization": "centurylink",
        "mediaUrl": "/img/icon-centurylink.png",
        "text": {
            "title": "Office Associate (Sep 16 - Sep 20)",
            "subtitle": "Centurylink",
            "description": [
                "Supported company-wide data consolidation efforts during a multi-company merger by creating and importing digital files into internal databases using proprietary software. Managed the organization and preparation of employee and customer documents for secure archival shipment."
            ]
        }
    }
}
